micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_system.h
/**
  ******************************************************************************
  * @file    stm32n6xx_ll_system.h
  * @author  MCD Application Team
  * @brief   Header file of SYSTEM LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
    [..]
    The LL SYSTEM driver contains a set of generic APIs that can be
    used by user:
      (+) Some of the FLASH features need to be handled in the SYSTEM file.
      (+) Access to DBGCMU registers
      (+) Access to SYSCFG registers
  @endverbatim
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32N6xx_LL_SYSTEM_H
#define STM32N6xx_LL_SYSTEM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx.h"

/** @addtogroup STM32N6xx_LL_Driver
  * @{
  */

#if defined (SYSCFG) || defined (DBGMCU)

/** @defgroup SYSTEM_LL SYSTEM
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Private_Constants SYSTEM Private Constants
  * @{
  */

/** @defgroup SYSTEM_LL_EC_CS1 SYSCFG Vdd compensation cell Code selection
  * @{
  */
#define LL_SYSCFG_VDD_CELL_CODE                  0U               /*VDD I/Os code from the cell (available in the SYSCFG_CCVR)*/
#define LL_SYSCFG_VDD_REGISTER_CODE              SYSCFG_CCCSR_CS1 /*VDD I/Os code from the SYSCFG compensation cell code register (SYSCFG_CCCR)*/
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Exported_Constants SYSTEM Exported Constants
  * @{
  */

/** @defgroup SYSTEM_LL_EC_I2C_FASTMODEPLUS SYSCFG I2C FASTMODEPLUS
  * @{
  */
#define LL_SYSCFG_I2C_FASTMODEPLUS_PA6     SYSCFG_CFGR1_PA6_FMP   /*!< Enable Fast Mode Plus on PA6  */
#define LL_SYSCFG_I2C_FASTMODEPLUS_PA7     SYSCFG_CFGR1_PA7_FMP   /*!< Enable Fast Mode Plus on PA7  */
#define LL_SYSCFG_I2C_FASTMODEPLUS_PA15    SYSCFG_CFGR1_PA15_FMP  /*!< Enable Fast Mode Plus on PA15 */
#define LL_SYSCFG_I2C_FASTMODEPLUS_PB3     SYSCFG_CFGR1_PB3_FMP   /*!< Enable Fast Mode Plus on PB3  */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_TIMBREAK SYSCFG TIMER BREAK
  * @{
  */
#define LL_SYSCFG_TIMBREAK_ECC             SYSCFG_CFGR2_ECCL  /*!< Enables and locks the ECC error signal
                                                                   with Break Input of TIM1/16/17                       */
#define LL_SYSCFG_TIMBREAK_PVD             SYSCFG_CFGR2_PVDL  /*!< Enables and locks the PVD connection
                                                                   with TIM1/16/17 Break Input and also
                                                                   the PVDE and PLS bits of the Power Control Interface */
#define LL_SYSCFG_TIMBREAK_SRAM_ECC_LOCK   SYSCFG_CFGR2_SPL   /*!< Enables and locks the SRAM ECC double error signal
                                                                   with Break Input of TIM1/16/17                       */
#define LL_SYSCFG_TIMBREAK_LOCKUP          SYSCFG_CFGR2_CLL   /*!< Enables and locks the LOCKUP output of CortexM33
                                                                   with Break Input of TIM1/16/17                       */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_SECURE_ATTRIBUTES Secure attributes
  * @note Only available when system implements security (TZEN=1)
  * @{
  */
#define LL_SYSCFG_CLOCK_SEC                SYSCFG_SECCFGR_SYSCFGSEC  /*!< SYSCFG clock configuration secure-only access */
#define LL_SYSCFG_CLOCK_NSEC               0U                        /*!< SYSCFG clock configuration secure/non-secure access */
#define LL_SYSCFG_CLASSB_SEC               SYSCFG_SECCFGR_CLASSBSEC  /*!< Class B configuration secure-only access */
#define LL_SYSCFG_CLASSB_NSEC              0U                        /*!< Class B configuration secure/non-secure access */
#define LL_SYSCFG_FPU_SEC                  SYSCFG_SECCFGR_FPUSEC     /*!< FPU configuration secure-only access */
#define LL_SYSCFG_FPU_NSEC                 0U                        /*!< FPU configuration secure/non-secure access */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_TIMBREAK SYSCFG TIMER BREAK
  * @{
  */
#define LL_DBGMCU_DBTRGIN                  0U                  /*!< DBTRGIO connected to DBTRGIN   */
#define LL_DBGMCU_DBTRGOUT                 DBGMCU_CR_DBTRGOEN  /*!<  DBTRGIO connected to DBTRGOUT */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB1_GRP1_STOP_IP DBGMCU APB1 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_APB1_GRP1_TIM2_STOP          DBGMCU_APB1LFZ1_DBG_TIM2_STOP
#define LL_DBGMCU_APB1_GRP1_TIM3_STOP          DBGMCU_APB1LFZ1_DBG_TIM3_STOP         /*!< TIM3 stop in debug */
#define LL_DBGMCU_APB1_GRP1_TIM4_STOP          DBGMCU_APB1LFZ1_DBG_TIM4_STOP         /*!< TIM4 stop in debug */
#define LL_DBGMCU_APB1_GRP1_TIM5_STOP          DBGMCU_APB1LFZ1_DBG_TIM5_STOP         /*!< TIM5 stop in debug */
#define LL_DBGMCU_APB1_GRP1_TIM6_STOP          DBGMCU_APB1LFZ1_DBG_TIM6_STOP         /*!< TIM6 stop in debug */
#define LL_DBGMCU_APB1_GRP1_TIM7_STOP          DBGMCU_APB1LFZ1_DBG_TIM7_STOP         /*!< TIM7 stop in debug */
#define LL_DBGMCU_APB1_GRP1_TIM12_STOP         DBGMCU_APB1LFZ1_DBG_TIM12_STOP        /*!< TIM12 stop in debug */
#define LL_DBGMCU_APB1_GRP1_TIM13_STOP         DBGMCU_APB1LFZ1_DBG_TIM13_STOP        /*!< TIM13 stop in debug */
#define LL_DBGMCU_APB1_GRP1_TIM14_STOP         DBGMCU_APB1LFZ1_DBG_TIM14_STOP        /*!< TIM14 stop in debug */
#define LL_DBGMCU_APB1_GRP1_LPTIM1_STOP        DBGMCU_APB1LFZ1_DBG_LPTIM1_STOP       /*!< LPTIM1 stop in debug */
#define LL_DBGMCU_APB1_GRP1_WWDG_STOP          DBGMCU_APB1LFZ1_DBG_WWDG1_STOP        /*!< WWDG1 stop in debug */
#define LL_DBGMCU_APB1_GRP1_TIM10_STOP         DBGMCU_APB1LFZ1_DBG_TIM10_STOP        /*!< TIM10 stop in debug */
#define LL_DBGMCU_APB1_GRP1_TIM11_STOP         DBGMCU_APB1LFZ1_DBG_TIM11_STOP        /*!< TIM11 stop in debug */
#define LL_DBGMCU_APB1_GRP1_I2C1_STOP          DBGMCU_APB1LFZ1_DBG_I2C1_STOP         /*!< I2C1 SMBUS timeout stop in debug */
#define LL_DBGMCU_APB1_GRP1_I2C2_STOP          DBGMCU_APB1LFZ1_DBG_I2C2_STOP         /*!< I2C2 SMBUS timeout stop in debug */
#define LL_DBGMCU_APB1_GRP1_I2C3_STOP          DBGMCU_APB1LFZ1_DBG_I2C3_STOP         /*!< I2C3 SMBUS timeout stop in debug */
#define LL_DBGMCU_APB1_GRP1_I3C1_STOP          DBGMCU_APB1LFZ1_DBG_I3C1_STOP         /*!< I3C1 SMBUS timeout stop in debug */
#define LL_DBGMCU_APB1_GRP1_I3C2_STOP          DBGMCU_APB1LFZ1_DBG_I3C2_STOP         /*!< I3C2 SMBUS timeout stop in debug */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB1_GRP2_STOP_IP DBGMCU APB1 GRP2 STOP IP
  * @{
  */
#define LL_DBGMCU_APB1_GRP2_FDCAN_STOP         DBGMCU_APB1HFZ1_DBG_FDCAN_STOP       /*!< FDCAN stop in debug */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB2_GRP1_STOP_IP DBGMCU APB2 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_APB2_GRP1_TIM1_STOP         DBGMCU_APB2FZ1_DBG_TIM1_STOP            /*!< TIM1 stop in debug */
#define LL_DBGMCU_APB2_GRP1_TIM8_STOP         DBGMCU_APB2FZ1_DBG_TIM8_STOP            /*!< TIM8 stop in debug */
#define LL_DBGMCU_APB2_GRP1_TIM18_STOP        DBGMCU_APB2FZ1_DBG_TIM18_STOP           /*!< TIM18 stop in debug */
#define LL_DBGMCU_APB2_GRP1_TIM15_STOP        DBGMCU_APB2FZ1_DBG_TIM15_STOP           /*!< TIM15 stop in debug */
#define LL_DBGMCU_APB2_GRP1_TIM16_STOP        DBGMCU_APB2FZ1_DBG_TIM16_STOP           /*!< TIM16 stop in debug */
#define LL_DBGMCU_APB2_GRP1_TIM17_STOP        DBGMCU_APB2FZ1_DBG_TIM17_STOP           /*!< TIM17 stop in debug */
#define LL_DBGMCU_APB2_GRP1_TIM9_STOP         DBGMCU_APB2FZ1_DBG_TIM9_STOP            /*!< TIM9 stop in debug */
/**
  * @}
  */

